0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0; // Was 1e-7

boundaryField
{

    turbine
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    "(inlet|outlet)"
    {
        type            calculated;
        value           uniform 0;
    }

    top
    {
        type            calculated;
        value           uniform 0;
    }

    bottom
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    walls
    {
        type            calculated;
        value           uniform 0;
    }

    AMI1
    {
        type  		cyclicAMI;
        value   	$internalField;
    }

    AMI2
    {
        type  		cyclicAMI;
        value   	$internalField;
    }

    "proc.*"
    {
        type            processor;
    }

}


// ************************************************************************* //
